<a href="https://colab.research.google.com/github/jcmachicao/gdmk_herramientas_practicas/blob/master/hgdmk__funciones_bd.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Gestión de Datos

* Resumenes de datos
* Resulmenes por colapso (por variables)
* Stata _n y _N, equivalentes en Python
* Reestructurar una data con reshape
* Combinación, concatenación, unión
* Identificar duplicados

In [4]:
#@title Importación de librerías
import pandas as pd

In [8]:
#@title Creación de una base de datos pequeña
data = pd.DataFrame({
        'Var1': [2, 4, 4, 8, 3, 3, 5, 4, 3, 8],
        'Var2': [1, 4, 8, 4, 3, 2, 3, 5, 4, 4],
        'País': ['Perú', 'Argentina', 'Chile', 'Brasil', 'Chile', 'Argentina', 'Perú', 'Brasil', 'Chile', 'Brasil']
})
data

   Var1  Var2       País
0     2     1       Perú
1     4     4  Argentina
2     4     8      Chile
3     8     4     Brasil
4     3     3      Chile
5     3     2  Argentina
6     5     3       Perú
7     4     5     Brasil
8     3     4      Chile
9     8     4     Brasil

In [9]:
#@title Extracción de información general de la BD
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Var1    10 non-null     int64
 1   Var2    10 non-null     int64
 2   País    10 non-null     object
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [10]:
#@title Descripción de la estadística básica de una BD
data.describe()

            Var1       Var2
count  10.000000  10.000000
mean    4.400000   3.800000
std     2.065591   1.873796
min     2.000000   1.000000
25%     3.000000   3.000000
50%     4.000000   4.000000
75%     4.750000   4.000000
max     8.000000   8.000000

In [11]:
#@title Colapso de variables
data_pais = data.groupby(['País'], axis=0).sum()
data_pais

           Var1  Var2
País
Argentina     7     6
Brasil       20    13
Chile        10    15
Perú          7     4

In [12]:
#@title Identificación de duplicados
col_dup = data.duplicated()
data['dupli'] = col_dup
data

   Var1  Var2       País  dupli
0     2     1       Perú  False
1     4     4  Argentina  False
2     4     8      Chile  False
3     8     4     Brasil  False
4     3     3      Chile  False
5     3     2  Argentina  False
6     5     3       Perú  False
7     4     5     Brasil  False
8     3     4      Chile  False
9     8     4     Brasil   True

In [13]:
dup_pais = data.duplicated(subset=['País'])
data['dup_pais'] = dup_pais
data

   Var1  Var2       País  dupli  dup_pais
0     2     1       Perú  False     False
1     4     4  Argentina  False     False
2     4     8      Chile  False     False
3     8     4     Brasil  False     False
4     3     3      Chile  False      True
5     3     2  Argentina  False      True
6     5     3       Perú  False      True
7     4     5     Brasil  False      True
8     3     4      Chile  False      True
9     8     4     Brasil   True      True